Tekla.Structures.DrawingInternal.AssociativityManager.SetViewPreferredRuleObject(Tekla.Structures.Identifier,System.Int32)
Sets the preferred object id for the rules of a view
viewId: The identifier of the view
preferredObjectId: The id of the preferred object

Tekla.Structures.DrawingInternal.AssociativityManager.GetDimensionPointLocation(System.Int32,Tekla.Structures.DrawingInternal.AssociativityCommandEnum,System.Int32@,System.Int32@)
Retrieves the screen location of a dimension point.
dimensionId: Id of the dimension under consideration
command: fetch the location of a start point or end point
screenX: the screen x location of the dimension point
screenY: the screen y location of the dimension point
Returns: true in case of success, false otherwise